Carlos43525/Simple-ESP8266-Microserver/main.cpp
#include <ESP8266WiFi.h>
#include <WiFiClient.h>
#include <ESP8266WiFiMulti.h>
#include <ESP8266mDNS.h>
#include <ESP8266WebServer.h> // Include the WebServer library

ESP8266WiFiMulti wifiMulti; // Create an instance of the ESP8266WiFiMulti class, called 'wifiMulti'

ESP8266WebServer server(80); // Create a webserver object that listens for HTTP request on port 80

const int GLED = 12; // green
const int BLED = 13; // blue

int ledState = LOW;

unsigned long previousMillis = 0;
const long interval = 1000;

void handleRoot(); // function prototypes for HTTP handlers
void handleNotFound();

void setup(void){
pinMode(GLED, OUTPUT);
pinMode(BLED, OUTPUT);



Serial.begin(115200); // Start the Serial communication to send messages to the computer
delay(10);
Serial.println('\n');

wifiMulti.addAP("NOFD-Guest", "nofdwireless!"); // add Wi-Fi networks you want to connect to
digitalWrite(BLED, HIGH);
delay(50);
digitalWrite(BLED, LOW);
delay(50);
digitalWrite(BLED, HIGH);
delay(50);
digitalWrite(BLED, LOW);
delay(50);
digitalWrite(BLED, HIGH);
delay(50);
digitalWrite(BLED, LOW);
delay(50);
digitalWrite(BLED, HIGH);
delay(50);
digitalWrite(BLED, LOW);
delay(50);
digitalWrite(BLED, HIGH);
delay(50);
digitalWrite(BLED, LOW);
delay(50);
digitalWrite(BLED, HIGH);

Serial.println("Connecting ...");
int i = 0;
while (wifiMulti.run() != WL_CONNECTED) { // Wait for the Wi-Fi to connect: scan for Wi-Fi networks, and connect to the strongest of the networks above
delay(250);
Serial.print('.');
}
Serial.println('\n');
Serial.print("Connected to ");
Serial.println(WiFi.SSID()); // Tell us what network we're connected to
Serial.print("IP address:\t");
Serial.println(WiFi.localIP()); // Send the IP address of the ESP8266 to the computer

if (MDNS.begin("esp8266")) { // Start the mDNS responder for esp8266.local
Serial.println("mDNS responder started");
} else {
Serial.println("Error setting up MDNS responder!");
}

server.on("/", handleRoot); // Call the 'handleRoot' function when a client requests URI"/"
server.onNotFound(handleNotFound); // When a client requests an unknown URI (i.e. something other than "/"), call function "handleNotFound"
server.begin(); // Actually start the server
Serial.println("HTTP server started");

digitalWrite(BLED, LOW);
delay(50);
digitalWrite(BLED, HIGH);
delay(50);
digitalWrite(BLED, LOW);
delay(50);
digitalWrite(BLED, HIGH);
delay(50);
digitalWrite(BLED, LOW);
delay(50);
digitalWrite(BLED, HIGH);
delay(50);
digitalWrite(BLED, LOW);
}

void loop(void){
server.handleClient(); // Listen for HTTP requests from clients
 unsigned long currentMillis = millis();
  if (currentMillis - previousMillis >= interval) {
    previousMillis = currentMillis;
    if (ledState == LOW) {
      ledState = HIGH;  
    } else {
      ledState = LOW;  
    }
    digitalWrite(GLED, ledState);
  }
}

void handleRoot() {
server.send(200, "text/plain", "Hello world!"); // Send HTTP status 200 (Ok) and send some text to the browser/client
}

void handleNotFound(){
server.send(404, "text/plain", "404: Not found"); // Send HTTP status 404 (Not Found) when there's no handler for the URI in the request
}